snlkuharlocal/src/InformationRegisters/СостояниеПакетовОбмена/СостояниеПакетовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеПакетовОбмена</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИД_ЗаданияЗагрузкиДанных</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ПакетаЗаданийЗагрузки</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибкиЗагрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРедактированияЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пакет</name>
    <type>
      <types>CatalogRef.ФР_ПакетыДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодУзла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/СостояниеПакетовОбмена/ManagerModule.bsl
Функция ОбновитьСтатусПакета(Пакет, Поля, Знач ИмяПланаОбмена = "") Экспорт
	Если ПустаяСтрока(ИмяПланаОбмена) И ЗначениеЗаполнено(Пакет) И МаркировкаС.ОбъектСуществует(Пакет) Тогда
		ИмяПланаОбмена = ПолучитьРеквизитШапки(Пакет, "ПланОбмена"); 			 
	КонецЕсли;
	
	Отбор = Новый Структура("Пакет,КодУзла", Пакет, Маркировка_ПИ.ЭтотУзел_Код(ИмяПланаОбмена));
	
	МЗ = РегистрыСведений.СостояниеПакетовОбмена.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ, Отбор);
	
	МЗ.Прочитать();
	Если НЕ ЗначениеЗаполнено(МЗ.Пакет) Тогда
		ЗаполнитьЗначенияСвойств(МЗ, Отбор);
	КонецЕсли;                              
	
	ЗаполнитьЗначенияСвойств(МЗ, Поля);
	
	МЗ.ДатаРедактированияЗаписи = ТекущаяДата();
	
	МЗ.Записать();
КонецФункции //Функция ОбновитьСтатусПакета(Пакет, Поля, ИмяПланаОбмена = "ДанныеЧЗ") Экспорт

Функция ПолучитьЗаписьЗагрузки(Пакет, КодУзла) Экспорт
	Результат = Новый Структура("Период, ИД_ЗаданияЗагрузкиДанных");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1	
	|	ИД_ПакетаЗаданийЗагрузки,
	|	ИД_ЗаданияЗагрузкиДанных
	|ИЗ
	|	РегистрСведений.СостояниеПакетовОбмена	
	|ГДЕ
	|	 Пакет = &Пакет
	|	 И КодУзла = &КодУзла	
	|";
	
	Запрос.УстановитьПараметр("Пакет",		Пакет);
	Запрос.УстановитьПараметр("КодУзла",	КодУзла);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);			
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ПолучитьЗаписьЗагрузки(Пакет, КодУзла) Экспорт

Функция ЗагрузитьДанные_Регистра(ДанныеПакета, Отправитель, ДопПараметры = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Таблицы	= МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеПакета, "Таблицы");	
	
	Записи 	= Неопределено;	
	Для Каждого КиЗ Из Таблицы Цикл		
		Если СтрНачинаетсяС(КиЗ.Ключ,"Записи_") Тогда			
			Записи = КиЗ.Значение;
		КонецЕсли;		
	КонецЦикла;
	
	Если Записи = Неопределено Тогда
		Результат.Ошибки.Добавить("Не обнаружено таблицы с данными записей регистра !");
		Возврат Результат;	
	КонецЕсли;
	
	Для Каждого ДанныеИст Из Записи Цикл		       
		Пакет = ДанныеИст.Пакет;
		Если НЕ (ЗначениеЗаполнено(Пакет) И ТипЗнч(Пакет) = Тип("СправочникСсылка.ФР_ПакетыДанных")) Тогда 
			Продолжить;		
		КонецЕсли;
		
		Если МаркировкаС.ОбъектСуществует(Пакет) Тогда
			рПакета = ПолучитьРеквизитыШапки(ДанныеИст.Пакет, "ПланОбмена,Отправитель,Получатель");		
			
			ПланОбмена		= рПакета.ПланОбмена;
			КодТекущегоУзла = Маркировка_ПИ.ЭтотУзел_Код(ПланОбмена);
			
			Запись = РегистрыСведений.СостояниеПакетовОбмена.СоздатьМенеджерЗаписи();
			
			Запись.Пакет 	= Пакет;
			Запись.КодУзла  = КодТекущегоУзла;
			
			Запись.Прочитать();
			
			Если СокрЛП(рПакета.Отправитель) = КодТекущегоУзла Тогда				
				Поля = Новый Структура("ДатаПолучения,ДатаЗагрузки,Состояние");
				ЗаполнитьЗначенияСвойств(Поля, ДанныеИст);
				
				Если НЕ ЗначениеЗаполнено(Запись.Состояние) Тогда
					Состояние = Неопределено;
					Если ЗначениеЗаполнено(ДанныеИст.ДатаЗагрузки) Тогда
						Если ДанныеИст.ЕстьОшибкиЗагрузки Тогда
							Состояние = "Ошибка";
						Иначе
							Состояние = "Загружен";
						КонецЕсли;				
					Иначе				
						Состояние = "Получен";			
					КонецЕсли;					
					Поля.Вставить("Состояние", Состояние);
				КонецЕсли;				
			ИначеЕсли СокрЛП(рПакета.Получатель) = КодТекущегоУзла Тогда				
				Поля = Новый Структура("ДатаОтправки,ДатаСоздания");
				ЗаполнитьЗначенияСвойств(Поля, ДанныеИст);
			Иначе
				Поля = Новый Структура;				
			КонецЕсли;
			
			ОбновитьСтатусПакета(Пакет, Поля, рПакета.ПланОбмена);
		Иначе //Тут все проще - нет пакета - значит полностью новая запись			
			//Запись = РегистрыСведений.СостояниеПакетовОбмена.СоздатьМенеджерЗаписи();			
			//ЗаполнитьЗначенияСвойств(Запись, ДанныеИст);			
			//Запись.КодУзла 	= КодТекущегоУзла;			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;	
КонецФункции //ЗагрузитьДанные_Регистра(ДанныеПакета, Отправитель, ДопПараметры = Неопределено) Экспорт
